"""დავალება1 : გამოვიტანოტ while ციკლით 0 იდან 20 ის ჩათვლით ყველა ლუწი რიცხვი"""

i = 0
while i <= 20:
    print(i)
    i = i + 2

"""დავალება2: while ციკლით გამოვიტანოთ 0 იდან 10 ამდე რიცხვები"""

i = 10
while i >= 1:
    print(i)
    i = i - 1

"""დავალება3: 1 იდან 100 ის ჩათვლით გამოიტანეტ რიცხვთა ჯამი"""

i = 1
while i <= 100:
    i = i + 1
    print(i)


"""დავალება4: 50 იდან 100 ის ჩათვლით არსებული 5 ის ჯერადების ჯამი გამოიტანეთ, გამოიყენეთ while ციკლი"""

i = 50
while i <= 100:
    i = i + 5
    print(i)

