"""გამოიწერეთ GOA-ს და low budget stories-ის არხები, უყურეთ და დაალაიქეთ ვიდეოები

გაიცანით GOAელები დისქორდზე, ემეგობრეთ, ერთად დაჯექით სერვერზე და დაუახლოვდით. 

print("გავიცანი და დავუმეგობრდი:  " ) ჩამოწერეთ ყველა ვისაც დაუმეგობრდით 

print("რას ვფიქრობ GOAზე" ) 
დაპრინტეთ თქვენი აზრი გოაზე,

ატვირთეთ ყველაფერი გითჰაბზე, day 2 folder-ში, იგივე რეპოზიტორიაში. 

წარმატებები

ჩაეხუტეთ დედიკოს/მამიკოს"""




name = "mate"

#name არის ცვლადი
# = არის ცვლადისთვის მნიშვნელობის მიმნიჭებელი სიმბოლო
# "mate" არის ცვლადისთვის მნიშვნელობა

surname = "nikoleishvili"

print(name)
#print ფუნქციას გადაეცემა ეკრანზე გამოსატანი ობიექტი


name = "mate" # ეს არის str (string) ტიპის ცვლადი
age = 15 # ეს არის int (integer)მთელი რიცხვი
height = 160.5 # ეს არის float ტიპის ცვლადი (ათწილადი)
# boolean (bool) ტიპის ცვლადი

knows_programming = True #true ან false
is_ugly = False


#print(name + " " + surname)

#სრინგი არის ბრჭყალებშ
#print(name + " "+ age)

print(name + " " + str(age))
