"""დავალება: შექმენით range-ის კოპიო ფუნქცია - my_range. მას გადაეცემა start, end, step.
 ფუნქციაში შემდეგ შექმენით სია,
 სადაც გექნებათ start-სა და end-ს შორის არსებული რიცხვები,
 გაითვალისიწინეთ step. არ გამოიყენოთ range()"""









"""დავალება2: შექმენით ფუნქცია სახელად my_filter, რომელსაც გადაეცემა ერთი სია და სიმბოლო,
 რომელიც სიიდან ამოიშლება. საბოლოოდ დააბრუნეთ სია, სადაც არ იქნება არც ერთი ეს სიმბოლო"""



"""დავალება3: შექმენით ფუნქცია,
 რომელსაც გადაეცემა სია. თქვენი დავალებაა, რომ ამ სიის დადებითი რიცხვების ნამრავლი დააბრუნოთ"""



"""დავალება4: შექმენით ფუნქცია სახელად greet
, რომელსაც გამოძახებისას გადასცემთ მომხმარებლის სახელს - დაბეჭდავს "Welcome მომხმარებლის სახელი აქ!"."""


def greet (i):
    print("welcome", i )
greet("nika")
greet("mate")
greet("luka")
